; domain
; IPC5 Domain: Pathways Propositional
; Authors: Yannis Dimopoulos, Alfonso Gerevini and Alessandro Saetti

(define (domain Pathways-Propositional) 
(:requirements :typing :adl)  

(:types level molecule - object
	simple complex - molecule) 

(:constants pCAF-p300 pRbp1p2-AP2  - complex)

(:predicates 
	     (association-reaction ?x1 ?x2 - molecule ?x3 - complex)
	     (catalyzed-association-reaction ?x1 ?x2 - molecule ?x3 - complex)
	     (synthesis-reaction ?x1 ?x2 - molecule)
             (possible ?x - molecule) 	
	     (available ?x - molecule)
             (chosen ?s - simple)
	     (next ?l1 ?l2 - level)
	     (num-subs ?l - level)
	     (goal1))


(:action choose
 :parameters (?x - simple ?l1 ?l2 - level)
 :precondition (and (possible ?x) (not (chosen ?x)) 
		    (num-subs ?l2) (next ?l1 ?l2))
 :effect (and (chosen ?x) (not (num-subs ?l2)) (num-subs ?l1)))

(:action initialize
  :parameters (?x - simple)
  :precondition (and (chosen ?x))
  :effect (and (available ?x)))

(:action associate
 :parameters (?x1 ?x2 - molecule ?x3 - complex)
 :precondition (and (association-reaction ?x1  ?x2  ?x3) 
		    (available ?x1) (available ?x2))
 :effect (and  (not (available ?x1)) (not (available ?x2)) (available ?x3)))

(:action associate-with-catalyze 
 :parameters (?x1 ?x2 - molecule ?x3 - complex)
 :precondition (and (catalyzed-association-reaction ?x1 ?x2 ?x3) 
		    (available ?x1) (available ?x2))
 :effect (and (not (available ?x1)) (available ?x3)))

(:action synthesize
 :parameters (?x1 ?x2 - molecule)
 :precondition (and (synthesis-reaction ?x1 ?x2) (available ?x1))
 :effect (and (available ?x2)))



(:action DUMMY-ACTION-1
 :parameters ()
 :precondition
	(or (available pRbp1p2-AP2)
	    (available pCAF-p300))
 :effect (and (goal1)))
)

; problem
(define (problem Pathways-01)
(:domain Pathways-Propositional)
(:objects
	SP1 - simple
	Raf1 - simple
	pRbp2 - simple
	pRb-E2F4p1-DP12 - simple
	pCAF - simple
	p300 - simple
	p16 - simple
	p130-E2F5p1-DP12 - simple
	E2F13 - simple
	DMP1 - simple
	Chk1 - simple
	cdk7 - simple
	cdk46p3-cycDp1 - simple
	cdk46p3-cycD - simple
	cdc25C - simple
	AP2 - simple
	DMP1p1 - complex
	cdc25Cp2 - complex
	p16-cdk7 - complex
	pRbp2-AP2 - complex
	pRbp1p2 - complex
	Raf1-p130-E2F5p1-DP12 - complex
	Raf1-pRb-E2F4p1-DP12 - complex
	SP1-E2F13 - complex
	l0 - level
	l1 - level
	l2 - level
	l3 - level)


(:init
	(possible SP1)
	(possible Raf1)
	(possible pRbp2)
	(possible pRb-E2F4p1-DP12)
	(possible pCAF)
	(possible p300)
	(possible p16)
	(possible p130-E2F5p1-DP12)
	(possible E2F13)
	(possible DMP1)
	(possible Chk1)
	(possible cdk7)
	(possible cdk46p3-cycDp1)
	(possible cdk46p3-cycD)
	(possible cdc25C)
	(possible AP2)
	(catalyzed-association-reaction cdc25C Chk1 cdc25Cp2)
	(catalyzed-association-reaction DMP1 cdk46p3-cycD DMP1p1)
	(catalyzed-association-reaction DMP1 cdk46p3-cycDp1 DMP1p1)
	(association-reaction p16 cdk7 p16-cdk7)
	(association-reaction pCAF p300 pCAF-p300)
	(association-reaction pRbp1p2 AP2 pRbp1p2-AP2)
	(association-reaction pRbp2 AP2 pRbp2-AP2)
	(catalyzed-association-reaction pRbp2 cdk46p3-cycDp1 pRbp1p2)
	(catalyzed-association-reaction pRbp2 cdk46p3-cycD pRbp1p2)
	(association-reaction Raf1 p130-E2F5p1-DP12 Raf1-p130-E2F5p1-DP12)
	(association-reaction Raf1 pRb-E2F4p1-DP12 Raf1-pRb-E2F4p1-DP12)
	(association-reaction SP1 E2F13 SP1-E2F13)
	(num-subs l0)
	(next l1 l0)
	(next l2 l1)
	(next l3 l2))


(:goal
	(and
	(goal1)))

)

; plan
1. (choose p300 l1 l0)
   deleted: (num-subs l0)
   added: (chosen p300) (num-subs l1)
   goals met: 0 of 1
2. (initialize p300)
   added: (available p300)
   goals met: 0 of 1
3. (choose pcaf l2 l1)
   deleted: (num-subs l1)
   added: (chosen pcaf) (num-subs l2)
   goals met: 0 of 1
4. (initialize pcaf)
   added: (available pcaf)
   goals met: 0 of 1
5. (associate pcaf p300 pcaf-p300)
   deleted: (available pcaf) (available p300)
   added: (available pcaf-p300)
   goals met: 0 of 1
6. (dummy-action-1)
   added: (goal1)
   goals met: 1 of 1
